export default {
  namespaced: true,
  state: {
    pagination: { perPage: 10, currentPage: 1 },
    LogsItems: [
      {
        id: 1,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Вход в личный кабинет',
      },
      {
        id: 2,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Вход в личный кабинет',
      },
      {
        id: 3,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Вход в личный кабинет',
      },
      {
        id: 4,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Успешная идентификация пользователя при авторизации',
      },
      {
        id: 5,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Успешная идентификация пользователя при авторизации',
      },
      {
        id: 6,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Изменение пароля',
      },
      {
        id: 7,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Изменение имени пользователя',
      },
      {
        id: 8,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Вход в личный кабинет',
      },
      {
        id: 9,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Изменние e-mail адреса',
      },
      {
        id: 10,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Вход в личный кабинет',
      },
      {
        id: 11,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Успешная идентификация пользователя при авторизации',
      },
      {
        id: 12,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Успешная идентификация пользователя при авторизации',
      },
      {
        id: 13,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Изменение имени пользователя',
      },
      {
        id: 14,
        data: '28-03-2021 00:51',
        ip: '192.168.123.456',
        title: 'Успешная идентификация пользователя при авторизации',
      },

    ],

  },
  mutations: {
    paginations(state, payload) {
      state.pagination = payload
    },
  },
}
